Revit 2026 API

# DirectShapeLibraryAddDefinition(String, IListGeometryObject) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddDefinition(
	string id,
	IList<GeometryObject> GNodes
)
```
```vb
Public Sub AddDefinition (
	id As String,
	GNodes As IList(Of GeometryObject)
)
```
```cpp
public:
void AddDefinition(
	String^ id,
	IList<GeometryObject^>^ GNodes
)
```
```fsharp
member AddDefinition :
        id : string *
        GNodes : IList<GeometryObject> -> unit
```

#### Parameters

id String

GNodes IListGeometryObject

#### Reference

DirectShapeLibrary Class

AddDefinition Overload

Autodesk.Revit.DB Namespace